index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-11 Mon 18:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Connor Parsons</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Connor Parsons
<br />
<span class="subtitle">Software Engineer<br> <a href="https://linkedin.com/in/connorparsons">Linkedin</a> <a href="https://connorparsons.com">Website</a></span>
</h1>


<div id="outline-container-orgb6cf4f8" class="outline-2">
<h2 id="orgb6cf4f8">Technical Skills</h2>
<div class="outline-text-2" id="text-orgb6cf4f8">
<p>
C#, Javascript, .NET, Node.js, SQL, NoSQL, Git, Amazon Web Services, Express.js, Electron, React, HTML, CSS, jQuery, Bootstrap, Stripe, Plaid, Mongo, Mongoose, Webpack,
Mocha, Heroku, Digital Ocean, Twilio
</p>
</div>
</div>

<div id="outline-container-orgd358afe" class="outline-2">
<h2 id="orgd358afe">Experience</h2>
<div class="outline-text-2" id="text-orgd358afe">
</div>
<div id="outline-container-orge48e062" class="outline-4">
<h4 id="orge48e062">DXC Technology, New Orleans, LA</h4>
<div class="outline-text-4" id="text-orge48e062">
<p>
<i>Software Engineer</i>
<br>
Jan. 2019 - current
</p>
</div>
<ul class="org-ul">
<li><a id="org2240d16"></a>Global Payments<br />
<div class="outline-text-5" id="text-org2240d16">
<ul class="org-ul">
<li>Created PDF and raw data parsers and diffing tool to detect variance between files</li>
<li>Collaborated on React frontend</li>
</ul>
</div>
</li>
<li><a id="org15b83a3"></a>Internal POC<br />
<div class="outline-text-5" id="text-org15b83a3">
<ul class="org-ul">
<li>Built client web app in Vue for uploading audio file</li>
<li>Wrote Lambda functions and S3 triggers for storage and transcription of audio to text data</li>
<li>Used AWS Transcribe to derive intent and keyword from transcript</li>
<li>Integrated AWS Elasticsearch with Kibana to display analytics in human-readable format.</li>
</ul>
</div>
</li>
<li><a id="org7c1be3a"></a>HP<br />
<div class="outline-text-5" id="text-org7c1be3a">
<ul class="org-ul">
<li>Implemented dynamically generated SQLite database tables to retain user data and push to central data lake</li>
<li>Made system calls in separate threads to monitor client device</li>
</ul>
</div>
</li>
<li><a id="org0687b5d"></a>Internal Talent Management Tool<br />
<div class="outline-text-5" id="text-org0687b5d">
<ul class="org-ul">
<li>Designed high-level architecture in AWS</li>
<li>Designed and implemented table schema for SQL database</li>
<li>Wrote an AWS Lambda function (Node.js) to consume nested JSON objects and write changes to database</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-org63ec311" class="outline-4">
<h4 id="org63ec311">Interactive Information Systems, New Orleans, LA</h4>
<div class="outline-text-4" id="text-org63ec311">
<p>
<i>Software Engineer</i>
<br>
Aug. 2017 - Dec. 2018
</p>
</div>
<ul class="org-ul">
<li><a id="org76e826d"></a>First American Bankcard, Inc<br />
<div class="outline-text-5" id="text-org76e826d">
<ul class="org-ul">
<li>Designed and developed a reporting dashboard for accountants to query transaction and customer data and download reports in PDF and Excel formats</li>
<li>Used AWS Lambda to run a function that pulls CSV files from an S3 bucket to parse and insert into a SQL database</li>
<li>Designed and developed a dashboard for accountants to compare and group transactions to create batches and add adjustments</li>
<li>Built a dashboard for casino employees to process and batch jackpot transactions, autopopulate relevant customer tax forms, and file electronically with the IRS</li>
</ul>
</div>
</li>
<li><a id="org5673919"></a>Jefferson Parish Juvenile Court<br />
<div class="outline-text-5" id="text-org5673919">
<ul class="org-ul">
<li>Built a dashboard to query clients and process client progress in the JPJC Deferral program</li>
<li>Developed a console application using Twilio to pull user data from a SQL database and send SMS text notifications to clients based on progress in the JPJC Deferral program</li>
<li>Designed and developed dashboards to review court cases referred to Deferral, process and upload necessary documents, schedule meetings and email an iCal event to relevant parties</li>
</ul>
</div>
</li>
<li><a id="org98acab4"></a>Delta Sigma Delta (International Dental Fraternity Organization)<br />
<div class="outline-text-5" id="text-org98acab4">
<ul class="org-ul">
<li>Helped design and implement membership management system where chapter administrators manage members</li>
<li>Set up role-based permissions for various types of users in organization</li>
<li>Designed and implemented all front-end views using Bootstrap</li>
</ul>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc65e6cc" class="outline-2">
<h2 id="orgc65e6cc">Education</h2>
<div class="outline-text-2" id="text-orgc65e6cc">
</div>
<div id="outline-container-orgd7e5048" class="outline-3">
<h3 id="orgd7e5048">Louisiana State University</h3>
<div class="outline-text-3" id="text-orgd7e5048">
<ul class="org-ul">
<li>Bachelors, Interdisciplinary Studies, 2019</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
